Revit 2024 API
Rebar.IncludeLastBar Property
 Identifies if the last bar in rebar set is shown.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2009
Syntax
C#
public bool IncludeLastBar { get; set; }
Visual Basic
Public Property IncludeLastBar As Boolean
	Get
	Set
Visual C++
public:
property bool IncludeLastBar {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace